/**
 * Abbreviation for the book itself in case included
 * in the in-page references
 */
let abbreviation = 'injil';

/**
 * Available books in the translation
 * NOTE: Must be lowercase for case insensitive array matching
 */
let books = {
  "mat": ["بُشْرَى مَتَّى"],
  "mar": ["بُشْرَى مَرْقُس"],
  "luk": ["بُشْرَى لُوقَا"],
  "joh": ["بُشْرَى يُحَنَّى"],
  "act": ["أَعْمَالُ سَيِّدِنَا عِيسَى خِلاَلَ الْحَوَارِيِّينَ"],
  "rom": ["كَلِمَةُ اللهِ إِلَى جَمَاعَةِ الْمُصْطَفَيْنَ فِي رُومَا بِقَلَمِ بَاوُلَ"],
  "1co": ["الْكَلِمَةُ الأُولَى إِلَى جَمَاعَةِ الْمُصْطَفَيْنَ فِي كُورِنْثَ بِقَلَمِ بَاوُلَ"],
  "2co": ["الْكَلِمَةُ الثَّانِيَةُ إِلَى جَمَاعَةِ الْمُصْطَفَيْنَ فِي كُورِنْثَ بِقَلَمِ بَاوُلَ"],
  "gal": ["كَلِمَةُ اللهِ إِلَى جَمَاعَةِ الْمُصْطَفَيْنَ فِي غَلاطِيَةَ بِقَلَمِ بَاوُلَ"],
  "eph": ["كَلِمَةُ اللهِ إِلَى جَمَاعَةِ الْمُصْطَفَيْنَ فِي أَفَاسَ بِقَلَمِ بَاوُلَ"],
  "phi": ["كَلِمَةُ اللهِ إِلَى جَمَاعَةِ الْمُصْطَفَيْنَ فِي فِيلِبِّي بِقَلَمِ بَاوُلَ"],
  "col": ["كَلِمَةُ اللهِ إِلَى جَمَاعَةِ الْمُصْطَفَيْنَ فِي كُولُوسِّي بِقَلَمِ بَاوُلَ"],
  "1th": ["الْكَلِمَةُ الأُولَى إِلَى جَمَاعَةِ الْمُصْطَفَيْنَ فِي تَسَالُونِيقَا بِقَلَمِ بَاوُلَ"],
  "2th": ["الْكَلِمَةُ الثَّانِيَةُ إِلَى جَمَاعَةِ الْمُصْطَفَيْنَ فِي تَسَالُونِيقَا بِقَلَمِ بَاوُلَ"],
  "1ti": ["الْكَلِمَةُ الأُولَى إِلَى تِيمُوثَا بِقَلَمِ بَاوُلَ"],
  "2ti": ["الْكَلِمَةُ الثَّانِيَةُ إِلَى تِيمُوثَا بِقَلَمِ بَاوُلَ"],
  "tit": ["كَلِمَةُ اللهِ إِلَى تِيطُسَ بِقَلَمِ بَاوُلَ"],
  "phm": ["كَلِمَةُ اللهِ إِلَى فِلِيمُونَ بِقَلَمِ بَاوُلَ"],
  "heb": ["كَلِمَةُ اللهِ إِلَى بَنِي إِسْرَائِيلَ"],
  "jam": ["كَلِمَةُ اللهِ بِقَلَمِ يَعْقُوبَ"],
  "1pe": ["الْكَلِمَةُ الأُولَى بِقَلَمِ صَخْرٍ"],
  "2pe": ["الْكَلِمَةُ الثَّانِيَةُ بِقَلَمِ صَخْرٍ"],
  "1jo": ["الْكَلِمَةُ الأُولَى بِقَلَمِ يُحَنَّى"],
  "2jo": ["الْكَلِمَةُ الثَّانِيَةُ بِقَلَمِ يُحَنَّى"],
  "3jo": ["الْكَلِمَةُ الثَّالِثَةُ بِقَلَمِ يُحَنَّى"],
  "jud": ["كَلِمَةُ اللهِ بِقَلَمِ يُودَا"],
  "rev": ["الرُّؤْيَا"],
};

export default { abbreviation, books };
