/**
 * Abbreviation for the book itself in case included
 * in the in-page references
 */
let abbreviation = 'tma';

/**
 * Available books in the translation
 * NOTE: Must be lowercase for case insensitive array matching
 */
let books = {
  'psa': ['مزامير العشق الإلهي'],
  'mat': ['الإنجيل الشّريف'],
  'mar': ['الإنجيل الشّريف'],
  'luk': ['الإنجيل الشّريف'],
  'joh': ['الوحيُ الذّي سجّله الحَواريُّ يوحنّا'],
  'act': ['سيرة الحَواريّين'],
  'rom': ['رسالة الحَواريّ بولس إلى أحباب الله في روما'],
  '1co': ['رسالة الحَواري بولُس الأولى إلى أحباب الله في كورِنْتوس'],
  '1co': ['رسالةُ الحَواري بولُس الأُولَى إلى أحباب الله في كُورِنْتوسَ'],
  '2co': ['رسالةُ الحَواريّ بولُس الثّانية إلى أحباب الله في كورِنْتوسَ'],
  '2co': ['رسالةُ الحَواريّ بولُس الثانية إلى أحباب الله في كورِنْتوسَ'],
  'gal': ['رسالة الحَواريّ بولُس إلى أحباب الله في غلاطية'],
  'gal': ['رسالة الحَواريّ بولُس إلى أحباب الله في غلاطية'],
  'eph': ['رسالة الحَواريّ بولس إلى أحباب الله في أفاسوس'],
  'phi': ['رسالة الحَواريّ بولُس إلى أحباب الله في فـيليبّي'],
  'col': ['رسالة الحَواريّ بولُس إلى أحباب الله في كولوسي'],
  '1th': ['رسالةُ الحَوَاريِّ بُولُسَ الأُولى إِلى أَحباب الله في تَسالونْكي'],
  '2th': ['رسالة الحَواريّ بولُس الثّانية إلى أحباب الله في تَسالونْكي'],
  '1ti': ['رسالة الحَواريّ بولُس الأُولى إلى تيموتاوي'],
  '1ti': ['رسالة الحَواريّ بولُس الأُولى إلى تيموتاوي'],
  '2ti': ['رسالة الحَواريّ بولُس الثّانية إلى تيموتاوي'],
  '2ti': ['رسالة الحَواريّ بولُس الثانية إلى تيموتاوي'],
  'tit': ['رسالة الحَواريّ بولُس إلى تيتوس'],
  'phm': ['رسالة الحَواريّ بولس إلى فِلِيمُونَ'],
  'heb': ['الرسالة إلى أتباع المسيح العِبرانيّين'],
  'jam': ['رسالة الحَواريّ يعقوب إلى أحباب الله'],
  '1pe': ['رسالة الحَواريّ صخر الأُولى إلى أحباب الله'],
  '1pe': ['رسالة الحواريّ صخر الأُولى إلى أحباب الله'],
  '2pe': ['رسالة الحَواريّ صخر الثّانية إلى أحباب الله'],
  '2pe': ['رسالة الحَواريّ صخر الثانية إلى أحباب الله'],
  '1jo': ['رسالة الحَواريّ يُوحَنّا الأُولى إلى أحباب الله'],
  '2jo': ['رسالة الحَواريّ يُوحَنَّا الثانية إلى أحباب الله'],
  '3jo': ['رسالة الحَواريّ يُوحَنَّا الثالثة إلى أحباب الله'],
  'jud': ['رسالة يهوذا إلى أحباب الله'],
  'rev': ['كتاب الرّؤيا'],
};

export default { abbreviation, books };
